Revit 2024 API
RoutingCriterionBase Members
The RoutingCriterionBase type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RoutingCriterionBase
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Verify if two criteria are the same.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RoutingCriterionBase Class
Autodesk.Revit.DB Namespace